[
    {
        "q": "2×20年1月1日，甲公司将自用的写字楼转换为以成本模式进行后续计量的投资性房地产。当日的账面余额为5000万元，已计提折500万元。已计提固定资产减值准备400万元。公允价值为4200万元。甲公司将该写字楼转为投资性房地产核算时的初始入账价值为( )万元.",
        "c": "A.4500\nB.4200\nC.4600\nD.4100",
        "a": "D"
    },
    {
        "q":"甲公司2x22年购入一项专利的法律保护期间为20年，自购入之日起剩余15年。甲公司预计该专利所在的领域技术更新迭代较快，预期使用该专利能够带来经济利益的期间为5年，根据甲公司管理层对该无形资产的使用计划，在使用满3年后，该专利将销售给第三方。上述甲公司在无形资产的后续计量中估计的使用寿命为().",
        "c":"A.20年\nB.3年\nC.8年\nD.15年",
        "a":"B"
    },
    {
        "q":"甲公司自行建造一个矿井于2x23年未完工并办理竣工决算手续，累计发生的支出包括: (1) 消耗材料支出5000万元; (2) 外包第三方乙公司进行建筑施工合同价款为3000万元，已支付给乙公司2500万元(3)建造期间发生工程物料收发计量差错盘亏100万元;此外甲公司预计采矿结束的需进行环境恢复预计发生的支出现值为200万元。2x23年未甲公司上述矿井的成本为()",
        "c":"A.7700万元\nB.8200万元\nC.8300万元\nD.7500万元",
        "a":"C"
    },
    {
        "q":"2x20年1月1日，甲公司以200万元的价格受让了一项软件著作权，预计使用4年后将其对外出售，该软件著作权的预计净残值为20万元，采用直线法摊销。2x22年6月30日，由于市场行情发生变化，该软件著作权的预计净残值为40万元，预计剩余使用寿命1.5年，不考虑其他因素，甲公司2x22年度对软件著作权计提的摊销金额是( )。",
        "c":"A.38.33万元\nB.42.50万元\nC.45万元\nD.50万元",
        "a":"A"
    },
    {
        "q":"2x22年1月，部分员工自愿办理离职，并于2x22年1月31日办理离职手续，应支付的补偿金额为240万元，2x22年12月又有部分员工自愿离职，并于2x22年12月办理离职手续，应支付补偿金为300万元，此外，甲公司预计2x23年上述有效期内，很可能有部分员工自愿选择离职，预计应支付补偿金额为200万元，不考虑其他因素，甲公司于2x22年 度应确认的辞退费用为()万元。",
        "c":"A.540\nB.40\nC.130\nD.740",
        "a":"A"
    },
    {
        "q":"2x22年1月1日，甲公司有三笔借款，分别是: (1)专门用于建造厂房的银行借款1000万元，借款到期日为2x23年6月30日，年利率为4%，(2) 发行用于补充流动资金的公司债券3000万元，债券到期日为2x24年9月30日，年利率为5%，(3) 取得一般银行借款2000万元，借款到期日为2x25年3月31日，年利率6%。甲公司2x22年9月1日开始建造一栋办公楼，并于当日通过银行转账支付了工程款1000万元。上述年利率与实际利率相同。不考虑其他因素，2x22年度甲公司的一般借款资本化率为( )。",
        "c":"A.5.17%\nB.5%\nC.6%\nD.5.4%",
        "a":"D"
    },
    {
        "q":"甲公司2x18年10月购入一项管理用无形资产，其入账价值为600万元，预计使用年限为6年，预计净残值为0，按照直线法摊销。2x19年12月31 日甲公司对其进行减值测试后计提减值准备100万元，计提减值后原预计的使用寿命、预计净残值和摊销方法均不变。2x20年12月31日该项无形资产公允价值减去处置费用后的净额为100万元，预计未来现金流量的现值为200万元。不考虑其他因素，与该项无形资产有关的业务对2x 20年甲公司利润总额的影响金额为（）万元。",
        "c":"A.-196.05\nB.-96.05\nC.-175\nD.-78.95",
        "a":"C"
    },
    {
        "q":"甲公司2022年归属于普通股股东的净利润为600万元，发行在外普通股加权平均数为1500万股，2022年3月1日，甲公司与股东签订一份远期回购合同，承诺1年后以每股6元的价格回购其发行在外的300万股普通股，9假设，该普通股2022年平均市场价格为4元/股，2022年3月至12月平均市场价格为5元/股2022年甲公司稀释每股收益为 ()。",
        "c":"A.0.36元/股\nB.0.38元/股\nC.0.39元/股\nD.0.40元/股",
        "a":"C"
    },
    {
        "q":"2x22年12月31日甲公司持有存货100件，账面价值500元，成本5元/件;当日，市场价格为4.5元/件。2x23年1月31日，该存货市场价格为4.4元/件，2月28日，该存货市场价格为4.8元/件。甲公司按月计提存货跌价准备。3月1日，商品全部卖出，甲公司应结转主营业务成本()元",
        "c":"A.500\nB.470\nC.430\nD.480",
        "a":"D"
    },
    {
        "q":"甲公司是乙公司的控股股东，为解决乙公司临时性经营资金短缺。甲公司向乙公司提供本金960万元的有息借款，约定10个月后偿还本息1000万元。利率符合市场利率，借款到期，乙公司发生财务困难，进行债务重组，根据重组安排，第三方债权人普遍豁免本息60%的偿还义务。甲公司豁免本息90%的偿还义务而收回100万元，乙公司债务重组收益为 ()。",
        "c":"A.100万元\nB.400万元\nC.900万\nD.600万元",
        "a":"D"
    },
    {
        "q":"甲公司通过二级市场回购股份以授予限制性股票的方式对员工进行股权激励。2X22年9月15日，甲公司股东大会通过股权激励方案，确定授予价格，并授权董事会确定具体人员和股份数量，11月28日，董事会确定具体人员和股份数量，并与员工签订认股协议，12月10日，员工向甲公司支付认购款，2X23年月25日，甲公司办理股权登记手续。甲公司该项股权激励授予日为 ()",
        "c":"A.2X22年9月15日\nB.2X22年11月28日\nC.2X22年12月10日\nD.2X23年1月25日",
        "a":"B"
    },
    {
        "q":"2021年1月1日承租人甲公司与出租人乙公司订立5年期的仓库租赁合同，租赁期开始日为2022年1月1日，甲公司有5年的续租选择权，但是租赁期开始日不能合理确定将会行使该选择权。2025年1月1日，乙公司在通知甲公司的情况下，可以于2025年3月31日后解除与甲公司的合同，且无需向甲公司支付违约金。甲公司没有提前终止租期的选择权。租赁开始时，合同的租赁期为()",
        "c":"A.4年3个月\nB.4年\nC.5年\nD.10年",
        "a":"C"
    },
    {
     "q":"甲公司2020年1月1日发行股认股权证，约定2021年7月1日为行权日，持有者在行权日可以以8元的价格购买1股甲公司新发行的2000万股股份。2020年甲公司发行普通股加权平均数为6000万股，普通股平均市价为每股10元，归属于普通股股东的净利润为5800万元，甲公司2020年稀释每股收益为( )。",
     "c":"A.0.73元/股\nB.0.91元/股\nC.0.76元/股\nD.0.97元/股",
     "a":"B"
    },
    {
    "q":"甲公司发生的有关交易或事项如下: (1)2x20年3月1日向乙公司销售商品。因乙公司未按合同约定付款，甲公司向法院提起诉讼，要求乙公司支付货款500万元以及违约金30万元。截至2x20年12月31日法院尚未做出判决。(2) 以前年度承接的一项建设和运营高速公路的PPP项目.自2*20年1月1日进入运营收费期，政府不对甲公司收取的车辆通行费提供保证，甲公司预计5年后需要对路面进行翻新发生费用600万元，路面翻新不构成单项履约义务。(3)2x20年2月1日丙公司的银行借款到期，由于丙公司未按期还款。银行提起诉讼要求甲公司履行其担保责任。甲公司预计需要向银行赔偿1000万元，2x21年2月18日法院做出终审判决.判定甲公司向银行赔偿1200万元。甲公司2*20年度财务报告于2x21年3月15日经批准报出。不考虑货币时间价值及其他因素，甲公司2x 20年12月31日的资产负债表中，应确认的负债金额是()。",
    "c":"A.1290万元\nB.1120万元\nC.1320万元\nD.1800万元",
    "a":"C"
    },
    {
    "q":"2x21年度，甲公司发生的有关交易或事项如下:（1）3月1日。因现金短缺。将账面价值8万元的自产产品用于发放职工工资。当日产品的市场价格为10万元。（2）5月1日，以账面价值400万元的自产产品抵债，向乙公司偿还欠款500万元，当日产品的市场价格为450万元。(3)9月30日，购入3万元食品作为国庆节福利发放给职工。不考虑其他因素。甲公司在编制2*21年度财务报表时应确认的收入是()。",
    "c":"A.513万元\nB.13万元\nC.450万元\nD.10万元",
    "a":"D"
    },
    {
    "q":" 2x20年12月1日，甲公司与乙公司签订租售协议。甲公司从乙公司租入某写字楼的1至2层作为办公用房。租赁协议约定。起租日为2x21年4月1日，到期日为2*26年12月31日，从起租日开始计算租金。租金每月30万元;甲公司有2年的续租选择权甲公司于2x21年1月1日进驻该写字楼并开始装修。甲公司不能合理确定将行使续租选择权。不考虑其他因素，甲公司对该租赁业务确定的租赁期是( )",
    "c":"A.7.75年\nB.8年\nC 5.75年\nD.6年",
    "a":"D"
    },
    {
    "q":"甲公司采购的原材料加工成产成品后对外的销售。 2x20年甲公司发生的有关交易或事项如下: (1)采购原材料支付购买价款100万元.入库前发生运输费用2万元（2）加工成本20万元。其中非正常消耗物料1万元(3)产成品运至客户处，发生运输费用3万元，截至2x20年12月31日， 产成品的控制权尚末转移给客户。不考虑其他因素.2*20年12月31日，甲公司资产负债表中存货列示的金额是(  ）",
    "c":"A 124万元\nB. 121万元\nC.120万元\nD.122万元",
    "a":"B"
    },
    {
    "q":" 2*20年12月31日。甲公司合并资产负债表中货币资金9800万元.其中: (1)银行承兑汇堡保证金存数500万，该保过金存款在银行承兑汇票到职兑付之前不得支现。(2)客户预付款600万元，客户要求存入甲公司单独开立的银行账户中，并且款项只能用于为客户建造仓库。(3)境外子公司因外汇管制不能由母公司正常使用的银行存款800万元不考虑其他因素，甲公司合并现金流量表中，2*20年12月31日现金及现金等价物的金额是( )。",
    "c":"A 9300万元\nB. 8700万元\nC. 7900万元\nD.8400万元",
    "a":"B"
    },
    {
    "q":"2x20年1月1日。甲公司发行在外的普通股为20000万股；4月1日发行股份3000万股购买乙公司60%的股权。本次交易构成同一控制下企业合并。2*20年度，甲公司合并利润表净利润为12000万元，其中归属于母公司股东的净利润为10000万元(包含乙公司1至3月归属于母公司股东的净利润1000万元）。甲公司2x20年度合并财务报表中的基本每股收益是( ) ",
    "c":"A.0.39元/股\nB.0.43元/股\nC.0.40元/股\nD.0.52元/股",
    "a":"B"
    }
]
